IDC_GUCCO_FRAME_MATERIAL                      = "材料"
IDC_GUCCO_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GUCCO_LABEL_MATERIAL_MB                   = "主筋"
IDC_GUCCO_LABEL_MATERIAL_HB                   = "箍筋"
IDC_GUCCO_LABEL_HBEAM                         = "H型鋼"
IDC_GUCCO_LABEL_STUD                          = "剪力釘"
IDC_GUCCO_FRAME_SHAPE                         = "形狀"
IDC_GUCCO_RADIO_SHAPE_RECT                    = "矩形"
IDC_GUCCO_RADIO_SHAPE_CIRCLE                  = "圓柱"
IDC_GUCCO_FRAME_SECTION                       = "斷面"
IDC_GUCCO_LABEL_SECTION_WIDTH                 = "寬度"
IDC_GUCCO_LABEL_SECTION_HEIGHT                = "高度"
IDC_GUCCO_LABEL_SECTION_LENGTH_X              = "無支撐長度(x)"
IDC_GUCCO_LABEL_SECTION_LENGTH_Y              = "無支撐長度(y)"
IDC_GUCCO_LABEL_SECTION_KFACTOR_X             = "Kx"
IDC_GUCCO_LABEL_SECTION_KFACTOR_Y             = "Ky"
IDC_GUCCO_FRAME_HBEAM                         = "H型鋼"

//IDD_SRC_COLUMN_INPUT_DLG
IDC_GUCCO_FRAME_FORCE                         = "外力&&彎矩"
IDC_GUCCO_LABEL_FORCE_AXF                     = "軸力"
IDC_GUCCO_LABEL_FORCE_MEMX                    = "彎矩(x)"
IDC_GUCCO_LABEL_FORCE_MEMY                    = "彎矩(y)"
IDC_GUCCO_LABEL_FORCE_SHX                     = "剪力(x)"
IDC_GUCCO_LABEL_FORCE_SHY                     = "剪力(y)"
IDC_GUCCO_FRAME_COE                           = "係數"
IDC_GUCCO_LABEL_COE_CMX                       = "Cmx"
IDC_GUCCO_LABEL_COE_CMY                       = "Cmy"
IDC_GUCCO_LABEL_COE_BETAD                     = "βd"
IDC_GUCCO_INPUT_BTN_LCOMB                     = "載重組合 ..."
IDC_GUCCO_FRAME_SPLICE                        = "主筋間距"
IDC_GUCCO_FRAME_ARRANGE                       = "鋼筋&型鋼"
IDC_GUCCO_FRAME_REBAR                         = "鋼筋"
IDC_GUCCO_FRAME_MBAR                          = "主筋配置"
IDC_GUCCO_RADIO_REBAR_ALIGN_AUTO_CORNER       = "角落 (自動配置)"
IDC_GUCCO_RADIO_REBAR_ALIGN_AUTO_UNIFORM      = "平均配置"
IDC_GUCCO_RADIO_REBAR_ALIGN_USER              = "角落 (自定義 :"
IDC_GUCCO_CHK_LOADTR                          = "檢核外力傳遞"
IDC_GUCCO_LABEL_LOADTRANSMISSON_CASE1         = "外力僅施加於鋼構"
IDC_GUCCO_LABEL_LOADTRANSMISSON_CASE2         = "外力僅施加於混凝土"
IDC_GUCCO_LABEL_LOADTRANSMISSON_CASE3         = "外力同時施加於兩者"
IDC_GUCCO_FRAME_STUD                          = "擴頭剪力釘"
IDC_GUCCO_LABEL_STUD_TYPE                     = "類型"
IDC_GUCCO_LABEL_STUD_SPACE                    = "間距"
IDC_GUCCO_LABEL_STUD_LENGTH                   = "長度"
IDC_GUCCO_LABEL_STUD_NO_WEB                   = "數量 (腹板)"
IDC_GUCCO_LABEL_STUD_NO_FLG                   = "數量 (翼板)"
IDC_GUCCO_LABEL_STUD_WEB                      = "腹板"
IDC_GUCCO_LABEL_STUD_FLG                      = "翼板"
IDC_GUCCO_RADIO_SPLICE000                     = "不考慮搭接"
IDC_GUCCO_RADIO_SPLICE050                     = "50%"
IDC_GUCCO_RADIO_SPLICE100                     = "100%"
IDC_GUCCO_FRAME_PM_CURVE                      = "PM 曲線"
IDC_GUCCO_FRAME_RESULT                        = "檢核計算結果"
IDC_GUCCO_LABEL_STUD_WEB2                     = "支"
IDC_GUCCO_LABEL_STUD_FLG2                     = "支"
IDC_GUCCO_LABEL_REBAR_ALIGN_USER              = ")"

//IDD_SRC_COLUMN_SMODE_INPUT_SECT2_DLG
IDC_GUCCO_LABEL_UNIT2                         = "單位 :"
IDC_GUCCO_LABEL_UNIT                          = "單位"
IDC_GUCCO_LABEL_LOADTR                        = "外力施加於"
IDC_GUCCO_LABEL_EXTEND                        = "構件延伸至"
IDC_GUCCO_LABEL_FORCE_EXT                     = "外力"
IDC_GUCCO_LABEL_TR_REGION                     = "傳遞區域"
IDC_GUCCO_CHECK_REBAR_SPACE_AUTO              = "自動計算"
IDC_GUCCO_CHECK_REBAR_SPACE_AUTO_SPACE        = "間距"

//IDD_SRC_COMP_BEAM_FORC_DLG
IDD_SRC_COMP_BEAM_FORC_DLG                    = "集中載重"
IDC_SRC_COMPOSITE_BEAM_LIST_FORCE_SELECT_MEMB  = "選取構件"
IDC_SRC_LIST_FORCE_SELECT_BTN_ALL             = "全選"
IDC_SRC_LIST_FORCE_SELECT_BTN_NONE            = "全不選"
IDC_SRC_COMPOSITE_BEAM_LIST_FORCE_CONCENTRATED_FORCE  = "集中載重"
IDC_SRC_LIST_FORCE_BTN_APPLY                  = "套用"
IDC_SRC_LIST_FORCE_BTN_CANCEL                 = "取消"

// IDD_SRC_UCFT_PMODE_DLG
IDC_GUCFT_MATERIAL_GRP                        = "材料"
IDC_GUCFT_MATL_STC                            = "鋼構"
IDC_GUCFT_CONC_STC                            = "混凝土"
IDC_GUCFT_SECTION_GRP                         = "斷面"
IDC_GUCFT_FORCE_GRP                           = "外力"
IDC_GUCFT_AXIAL_STC                           = "軸力"
IDC_GUCFT_MX_STC                              = "彎矩 (x)"
IDC_GUCFT_MY_STC                              = "彎矩 (y)"
IDC_GUCFT_VX_STC                              = "剪力 (x)"
IDC_GUCFT_VY_STC                              = "剪力 (y)"
IDC_GUCFT_LENGTH_GRP                          = "長度"
IDC_GUCFT_LX_STC                              = "Lx"
IDC_GUCFT_LY_STC                              = "Ly"
IDC_GUCFT_KX_STC                              = "Kx"
IDC_GUCFT_KY_STC                              = "Ky"
IDC_GUCFT_LV_STC                              = "Lv"
IDC_GUCFT_LOADTR_CHK                          = "檢核外力傳遞"
IDC_GUCFT_EXT_FORCE_STC                       = "外力施加於"
IDC_GUCFT_CFT_EXTEND_STC                      = "CFT構件延伸至"
IDC_GUCFT_CALC_RESULT_GRP                     = "檢核計算結果"
IDC_GUCFT_INPUT_BTN_LCOMB                     = "載重組合 ..."
IDC_GUCFT_CHECK_SEISMIC_PROVISIONS            = "套用耐震設計特別規定"
IDC_GUCFT_RADIO_HIGH_DUCTILITY                = "高度韌性"
IDC_GUCFT_RADIO_MIDDLE_DUCTILITY              = "中度韌性"

/////// IDD_SRC_COMP_BEAM_PMODE_DLG
IDC_GUCCB_FRAME_MATERIAL                      = "材料"
IDC_GUCCB_LABEL_HBEAM                         = "H型鋼"
IDC_GUCCB_LABEL_STUD                          = "剪力釘"
IDC_GUCCB_LABEL_SHEARCON                      = "剪力連接器"
IDC_GUCCB_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GUCCB_FRAME_SECTION                       = "斷面"
IDC_GUCCB_FRAME_SLAB                          = "樓板"
IDC_GUCCB_LABEL_SLAB_THIC                     = "厚度"
IDC_GUCCB_FRAME_SHAPE_TYPE                    = "形狀"
IDC_GUCCB_RADIO_STYPE_T                       = "T形"
IDC_GUCCB_RADIO_STYPE_HALF_T                  = "半T形"
IDC_GUCCB_FRAME_DECKPLATE                     = "鋼承板"
IDC_GUCCB_RADIO_STUD                          = "擴頭剪力釘"
IDC_GUCCB_FRAME_SHEAR_CON_TYPE                = "剪力連接器"
IDC_GUCCB_RADIO_CHANNEL                       = "槽鋼"
IDC_GUCCB_FRAME_STUD                          = "擴頭剪力釘"
IDC_GUCCB_LABEL_STUD_TYPE                     = "型號"
IDC_GUCCB_LABEL_STUD_COLUMN                   = "行數"
IDC_GUCCB_LABEL_STUD_SPACE                    = "間距"
IDC_GUCCB_LABEL_STUD_LENGTH                   = "長度"
IDC_GUCCB_LABEL_CHANNEL_NUM                   = "數量"
IDC_GUCCB_LABEL_CHANNEL_SPACE                 = "間距"
IDC_GUCCB_LABEL_CHANNEL_WIDTH                 = "寬度"
IDC_GUCCB_RADIO_DRAW_SECT                     = "斷面圖"
IDC_GUCCB_RADIO_DRAW_VIBR                     = "樓板振動檢核"
IDC_GUCCB_FRAME_SPAN                          = "跨度 && 支撐"
IDC_GUCCB_CHK_SPAN_SUPPORT                    = "連續式側向支撐"
IDC_GUCCB_LABEL_SPAN_SPAN                     = "梁跨度"
IDC_GUCCB_LABEL_SPAN_SPACE                    = "梁間距"
IDC_GUCCB_LABEL_SPAN_UNBRACE                  = "無支撐長度"
IDC_GUCCB_FRAME_DLOAD                         = "設計載重"
IDC_GUCCB_LABEL_DLOAD_LL                      = "活載重"
IDC_GUCCB_LABEL_DLOAD_FL                      = "裝修鋪面載重"
IDC_GUCCB_LABEL_DLOAD_CL                      = "施工載重"
IDC_GUCCB_CHK_DLOAD_SELF                      = "考慮自重"
IDC_GUCCB_CHK_DLOAD_CONCENTRATE               = "考慮額外集中載重"
IDC_GUCCB_FRAME_DEFLECT                       = "撓度檢核參數"
IDC_GUCCB_LABEL_DEFLECTION_CONST              = "施工中"
IDC_GUCCB_LABEL_DEFLECTION_LIVE               = "活載重"
IDC_GUCCB_LABEL_DEFLECTION_SPAN_LIVE          = "跨度 /"
IDC_GUCCB_LABEL_DEFLECTION_ALL                = "靜載重 + 活載重"
IDC_GUCCB_LABEL_DEFLECTION_SPAN_ALL           = "跨度 /"
IDC_GUCCB_FRAME_VIBR                          = "振動"
IDC_GUCCB_LABEL_VIBR_LOAD                     = "載重係數"
IDC_GUCCB_LABEL_VIBR_TYPE                     = "載重類型"
IDC_GUCCB_LABEL_VIBR_BETA                     = "阻尼比 (β)"
IDC_GUCCB_FRAME_VIBR_SECT                     = "大梁斷面"
IDC_GUCCB_CHK_VIBR_GIRD                       = "考慮大梁"
IDC_GUCCB_LABEL_VIBR_SPAN                     = "大梁跨度"
IDC_GUCCB_LABEL_VIBR_POSITION                 = "大梁位置"
IDC_GUCCB_LABEL_VIBR_CONN                     = "接合形式"
IDC_GUCCB_FRAME_VIBR_GIRD_SECT                = "大梁斷面"
IDC_GUCCB_FRAME_PROPERTY                      = "斷面性質"
IDC_GUCCB_FRAME_RESULT                        = "檢核計算結果"
